src/Documents/ПоступлениеНаБанковскийСчет/ПоступлениеНаБанковскийСчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеНаБанковскийСчет</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКонтрагента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ПоступлениеНаБанковскийСчет/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		// Заполнение шапки
		Покупатель = ДанныеЗаполнения.Поставщик;
		Сумма = ДанныеЗаполнения.СуммаЗаказа;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		// Заполнение шапки
		Покупатель = ДанныеЗаполнения.Покупатель;
		Сумма = ДанныеЗаполнения.СуммаЗаказа;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		Если Константы.НесколькоВалют.Получить() Тогда
		Если  Валюта.Ссылка = Справочники.Валюта.ПустаяСсылка()  Тогда
			  Валюта = Константы.ВалютаПоУмолчанию.Получить();
		  КонецЕсли;
	  Иначе
		  Валюта = Константы.ВалютаПоУмолчанию.Получить();
	КонецЕсли;
КонецПроцедуры
